Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_regdef.h
/** \brief  DMA Clear Error Register */
typedef struct _Ifx_DMA_BLK_CLRE_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int CSER:1;                    /**< \brief [16:16] Clear Move Engine x Source Error (w) */
    unsigned int CDER:1;                    /**< \brief [17:17] Clear Move Engine x Destination Error (w) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int CSPBER:1;                  /**< \brief [20:20] Clear SPB Error (w) */
    unsigned int CSRIER:1;                  /**< \brief [21:21] Clear SRI Error (w) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int CRAMER:1;                  /**< \brief [24:24] Clear RAM Error (w) */
    unsigned int CSLLER:1;                  /**< \brief [25:25] Clear SLL Error (w) */
    unsigned int CDLLER:1;                  /**< \brief [26:26] Clear DLL Error (w) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_CLRE_Bits;

/** \brief  DMA Enable Error Register */
typedef struct _Ifx_DMA_BLK_EER_Bits
{
    unsigned int reserved_0:16;             /**< \brief \internal Reserved */
    unsigned int ESER:1;                    /**< \brief [16:16] Enable Move Engine x Source Error (rw) */
    unsigned int EDER:1;                    /**< \brief [17:17] Enable Move Engine x Destination Error (rw) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int ERER:1;                    /**< \brief [24:24] Enable Move Engine x RAM Error (rw) */
    unsigned int reserved_25:1;             /**< \brief \internal Reserved */
    unsigned int ELER:1;                    /**< \brief [26:26] Enable Move Engine x DMA Linked List Error (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_EER_Bits;

/** \brief  DMA Error Status Register */
typedef struct _Ifx_DMA_BLK_ERRSR_Bits
{
    unsigned int LEC:7;                     /**< \brief [6:0] Move Engine x Last Error Channel (rh) */
    unsigned int reserved_7:9;              /**< \brief \internal Reserved */
    unsigned int SER:1;                     /**< \brief [16:16] Move Engine x Source Error (rh) */
    unsigned int DER:1;                     /**< \brief [17:17] Move Engine x Destination Error (rh) */
    unsigned int reserved_18:2;             /**< \brief \internal Reserved */
    unsigned int SPBER:1;                   /**< \brief [20:20] Move Engine x SPB Bus Error (rh) */
    unsigned int SRIER:1;                   /**< \brief [21:21] Move Engine x SRI Bus Error (rh) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int RAMER:1;                   /**< \brief [24:24] Move Engine x RAM Error (rh) */
    unsigned int SLLER:1;                   /**< \brief [25:25] Move Engine x Safe Linked List Error (rh) */
    unsigned int DLLER:1;                   /**< \brief [26:26] Move Engine x DMA Linked List Error (rh) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_ERRSR_Bits;

/** \brief  DMA Move Engine Channel Address and Interrupt Control Register */
typedef struct _Ifx_DMA_BLK_ME_ADICR_Bits
{
    unsigned int SMF:3;                     /**< \brief [2:0] Source Address Modification Factor (rh) */
    unsigned int INCS:1;                    /**< \brief [3:3] Increment of Source Address (rh) */
    unsigned int DMF:3;                     /**< \brief [6:4] Destination Address Modification Factor (rh) */
    unsigned int INCD:1;                    /**< \brief [7:7] Increment of Destination Address (rh) */
    unsigned int CBLS:4;                    /**< \brief [11:8] Circular Buffer Length Source (rh) */
    unsigned int CBLD:4;                    /**< \brief [15:12] Circular Buffer Length Destination (rh) */
    unsigned int SHCT:4;                    /**< \brief [19:16] Shadow Control (rh) */
    unsigned int SCBE:1;                    /**< \brief [20:20] Source Circular Buffer Enable (rh) */
    unsigned int DCBE:1;                    /**< \brief [21:21] Destination Circular Buffer Enable (rh) */
    unsigned int STAMP:1;                   /**< \brief [22:22] Time Stamp (rh) */
    unsigned int ETRL:1;                    /**< \brief [23:23] Enable Transaction Request Lost Interrupt (rh) */
    unsigned int WRPSE:1;                   /**< \brief [24:24] Wrap Source Enable (rh) */
    unsigned int WRPDE:1;                   /**< \brief [25:25] Wrap Destination Enable (rh) */
    unsigned int INTCT:2;                   /**< \brief [27:26] Interrupt Control (rh) */
    unsigned int IRDV:4;                    /**< \brief [31:28] Interrupt Raise Detect Value (rh) */
} Ifx_DMA_BLK_ME_ADICR_Bits;

/** \brief  DMA Move Engine Channel Control Register */
typedef struct _Ifx_DMA_BLK_ME_CHCR_Bits
{
    unsigned int TREL:14;                   /**< \brief [13:0] Transfer Reload Value (rh) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int BLKM:3;                    /**< \brief [18:16] Block Mode (rh) */
    unsigned int RROAT:1;                   /**< \brief [19:19] Reset Request Only After Transaction (rh) */
    unsigned int CHMODE:1;                  /**< \brief [20:20] Channel Operation Mode (rh) */
    unsigned int CHDW:3;                    /**< \brief [23:21] Channel Data Width (rh) */
    unsigned int PATSEL:3;                  /**< \brief [26:24] Pattern Select (rh) */
    unsigned int reserved_27:1;             /**< \brief \internal Reserved */
    unsigned int PRSEL:1;                   /**< \brief [28:28] Peripheral Request Select (rh) */
    unsigned int reserved_29:1;             /**< \brief \internal Reserved */
    unsigned int DMAPRIO:2;                 /**< \brief [31:30] DMA Priority (rh) */
} Ifx_DMA_BLK_ME_CHCR_Bits;

/** \brief  DMA Move Engine Channel Status Register */
typedef struct _Ifx_DMA_BLK_ME_CHSR_Bits
{
    unsigned int TCOUNT:14;                 /**< \brief [13:0] Transfer Count Status (rh) */
    unsigned int reserved_14:1;             /**< \brief \internal Reserved */
    unsigned int LXO:1;                     /**< \brief [15:15] Old Value of Pattern Detection (rh) */
    unsigned int WRPS:1;                    /**< \brief [16:16] Wrap Source Buffer (rh) */
    unsigned int WRPD:1;                    /**< \brief [17:17] Wrap Destination Buffer (rh) */
    unsigned int ICH:1;                     /**< \brief [18:18] Interrupt from Channel (rh) */
    unsigned int IPM:1;                     /**< \brief [19:19] Pattern Detection from Channel (rh) */
    unsigned int reserved_20:2;             /**< \brief \internal Reserved */
    unsigned int BUFFER:1;                  /**< \brief [22:22] DMA Double Buffering Active Buffer (rh) */
    unsigned int FROZEN:1;                  /**< \brief [23:23] DMA Double Buffering Frozen Buffer (rh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_ME_CHSR_Bits;

/** \brief  DMA Move Engine Channel Destination Address Register x */
typedef struct _Ifx_DMA_BLK_ME_DADR_Bits
{
    unsigned int DADR:32;                   /**< \brief [31:0] Destination Address (rh) */
} Ifx_DMA_BLK_ME_DADR_Bits;

/** \brief  DMA Move Engine Read Register 0 */
typedef struct _Ifx_DMA_BLK_ME_R0_Bits
{
    unsigned int RD00:8;                    /**< \brief [7:0] Read Value for Move Engine x (rh) */
    unsigned int RD01:8;                    /**< \brief [15:8] Read Value for Move Engine x (rh) */
    unsigned int RD02:8;                    /**< \brief [23:16] Read Value for Move Engine x (rh) */
    unsigned int RD03:8;                    /**< \brief [31:24] Read Value for Move Engine x (rh) */
} Ifx_DMA_BLK_ME_R0_Bits;

/** \brief  DMA Move Engine Read Register 1 */
typedef struct _Ifx_DMA_BLK_ME_R1_Bits
{
    unsigned int RD10:8;                    /**< \brief [7:0] Read Value for Move Engine x (rh) */
    unsigned int RD11:8;                    /**< \brief [15:8] Read Value for Move Engine x (rh) */
    unsigned int RD12:8;                    /**< \brief [23:16] Read Value for Move Engine x (rh) */
    unsigned int RD13:8;                    /**< \brief [31:24] Read Value for Move Engine x (rh) */
} Ifx_DMA_BLK_ME_R1_Bits;

/** \brief  DMA Move Engine Read Register 2 */
typedef struct _Ifx_DMA_BLK_ME_R2_Bits
{
    unsigned int RD20:8;                    /**< \brief [7:0] Read Value for Move Engine x (rh) */
    unsigned int RD21:8;                    /**< \brief [15:8] Read Value for Move Engine x (rh) */
    unsigned int RD22:8;                    /**< \brief [23:16] Read Value for Move Engine x (rh) */
    unsigned int RD23:8;                    /**< \brief [31:24] Read Value for Move Engine x (rh) */
} Ifx_DMA_BLK_ME_R2_Bits;

