Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_regdef.h
/** \brief  DMA Move Engine Read Register 3 */
typedef struct _Ifx_DMA_BLK_ME_R3_Bits
{
    unsigned int RD30:8;                    /**< \brief [7:0] Read Value for Move Engine x (rh) */
    unsigned int RD31:8;                    /**< \brief [15:8] Read Value for Move Engine x (rh) */
    unsigned int RD32:8;                    /**< \brief [23:16] Read Value for Move Engine x (rh) */
    unsigned int RD33:8;                    /**< \brief [31:24] Read Value for Move Engine x (rh) */
} Ifx_DMA_BLK_ME_R3_Bits;

/** \brief  DMA Move Engine Read Register 4 */
typedef struct _Ifx_DMA_BLK_ME_R4_Bits
{
    unsigned int RD40:8;                    /**< \brief [7:0] Read Value for Move Engine x (rh) */
    unsigned int RD41:8;                    /**< \brief [15:8] Read Value for Move Engine x (rh) */
    unsigned int RD42:8;                    /**< \brief [23:16] Read Value for Move Engine x (rh) */
    unsigned int RD43:8;                    /**< \brief [31:24] Read Value for Move Engine x (rh) */
} Ifx_DMA_BLK_ME_R4_Bits;

/** \brief  DMA Move Engine Read Register 5 */
typedef struct _Ifx_DMA_BLK_ME_R5_Bits
{
    unsigned int RD50:8;                    /**< \brief [7:0] Read Value for Move Engine x (rh) */
    unsigned int RD51:8;                    /**< \brief [15:8] Read Value for Move Engine x (rh) */
    unsigned int RD52:8;                    /**< \brief [23:16] Read Value for Move Engine x (rh) */
    unsigned int RD53:8;                    /**< \brief [31:24] Read Value for Move Engine x (rh) */
} Ifx_DMA_BLK_ME_R5_Bits;

/** \brief  DMA Move Engine Read Register 6 */
typedef struct _Ifx_DMA_BLK_ME_R6_Bits
{
    unsigned int RD60:8;                    /**< \brief [7:0] Read Value for Move Engine x (rh) */
    unsigned int RD61:8;                    /**< \brief [15:8] Read Value for Move Engine x (rh) */
    unsigned int RD62:8;                    /**< \brief [23:16] Read Value for Move Engine x (rh) */
    unsigned int RD63:8;                    /**< \brief [31:24] Read Value for Move Engine x (rh) */
} Ifx_DMA_BLK_ME_R6_Bits;

/** \brief  DMA Move Engine Read Register 7 */
typedef struct _Ifx_DMA_BLK_ME_R7_Bits
{
    unsigned int RD70:8;                    /**< \brief [7:0] Read Value for Move Engine x (rh) */
    unsigned int RD71:8;                    /**< \brief [15:8] Read Value for Move Engine x (rh) */
    unsigned int RD72:8;                    /**< \brief [23:16] Read Value for Move Engine x (rh) */
    unsigned int RD73:8;                    /**< \brief [31:24] Read Value for Move Engine x (rh) */
} Ifx_DMA_BLK_ME_R7_Bits;

/** \brief  DMA Move Engine Channel Read Data CRC Register */
typedef struct _Ifx_DMA_BLK_ME_RDCRC_Bits
{
    unsigned int RDCRC:32;                  /**< \brief [31:0] Read Data CRC (rh) */
} Ifx_DMA_BLK_ME_RDCRC_Bits;

/** \brief  DMA Move Engine Channel Source Address Register */
typedef struct _Ifx_DMA_BLK_ME_SADR_Bits
{
    unsigned int SADR:32;                   /**< \brief [31:0] Source Start Address (rh) */
} Ifx_DMA_BLK_ME_SADR_Bits;

/** \brief  DMA Move Engine Channel Source and Destination Address CRC Register */
typedef struct _Ifx_DMA_BLK_ME_SDCRC_Bits
{
    unsigned int SDCRC:32;                  /**< \brief [31:0] Source and Destination Address CRC (rh) */
} Ifx_DMA_BLK_ME_SDCRC_Bits;

/** \brief  DMA Move Engine Channel Shadow Address Register */
typedef struct _Ifx_DMA_BLK_ME_SHADR_Bits
{
    unsigned int SHADR:32;                  /**< \brief [31:0] Shadowed Address (rh) */
} Ifx_DMA_BLK_ME_SHADR_Bits;

/** \brief  DMA Move Engine Status Register */
typedef struct _Ifx_DMA_BLK_ME_SR_Bits
{
    unsigned int RS:1;                      /**< \brief [0:0] Move Engine x Read Status (rh) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int WS:1;                      /**< \brief [4:4] Move Engine x Write Status (rh) */
    unsigned int reserved_5:11;             /**< \brief \internal Reserved */
    unsigned int CH:7;                      /**< \brief [22:16] Active Channel z in Move Engine x (rh) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_DMA_BLK_ME_SR_Bits;

/** \brief  DMA Channel Address and Interrupt Control Register x */
typedef struct _Ifx_DMA_CH_ADICR_Bits
{
    unsigned int SMF:3;                     /**< \brief [2:0] Source Address Modification Factor (rwh) */
    unsigned int INCS:1;                    /**< \brief [3:3] Increment of Destination Address (rwh) */
    unsigned int DMF:3;                     /**< \brief [6:4] Destination Address Modification Factor (rwh) */
    unsigned int INCD:1;                    /**< \brief [7:7] Increment of Destination Address (rwh) */
    unsigned int CBLS:4;                    /**< \brief [11:8] Circular Buffer Length Source (rwh) */
    unsigned int CBLD:4;                    /**< \brief [15:12] Circular Buffer Length Destination (rwh) */
    unsigned int SHCT:4;                    /**< \brief [19:16] Shadow Control (rwh) */
    unsigned int SCBE:1;                    /**< \brief [20:20] Source Circular Buffer Enable (rwh) */
    unsigned int DCBE:1;                    /**< \brief [21:21] Destination Circular Buffer Enable (rwh) */
    unsigned int STAMP:1;                   /**< \brief [22:22] Time Stamp (rwh) */
    unsigned int ETRL:1;                    /**< \brief [23:23] Enable Transaction Request Lost Interrupt (rwh) */
    unsigned int WRPSE:1;                   /**< \brief [24:24] Wrap Source Enable (rwh) */
    unsigned int WRPDE:1;                   /**< \brief [25:25] Wrap Destination Enable (rwh) */
    unsigned int INTCT:2;                   /**< \brief [27:26] Interrupt Control (rwh) */
    unsigned int IRDV:4;                    /**< \brief [31:28] Interrupt Raise Detect Value (rwh) */
} Ifx_DMA_CH_ADICR_Bits;

/** \brief  DMA Channel Configuration Register */
typedef struct _Ifx_DMA_CH_CHCFGR_Bits
{
    unsigned int TREL:14;                   /**< \brief [13:0] Transfer Reload Value (rwh) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int BLKM:3;                    /**< \brief [18:16] Block Mode (rwh) */
    unsigned int RROAT:1;                   /**< \brief [19:19] Reset Request Only After Transaction (rwh) */
    unsigned int CHMODE:1;                  /**< \brief [20:20] Channel Operation Mode (rwh) */
    unsigned int CHDW:3;                    /**< \brief [23:21] Channel Data Width (rwh) */
    unsigned int PATSEL:3;                  /**< \brief [26:24] Pattern Select (rwh) */
    unsigned int reserved_27:1;             /**< \brief \internal Reserved */
    unsigned int PRSEL:1;                   /**< \brief [28:28] Peripheral Request Select (rwh) */
    unsigned int reserved_29:1;             /**< \brief \internal Reserved */
    unsigned int DMAPRIO:2;                 /**< \brief [31:30] DMA Priority (rwh) */
} Ifx_DMA_CH_CHCFGR_Bits;

