Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_regdef.h
/** \brief  Access Enable Register 00 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_ACCEN00_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_ACCEN00;

/** \brief  Access Enable Register 01 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_ACCEN01_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_ACCEN01;

/** \brief  Access Enable Register 10 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_ACCEN10_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_ACCEN10;

/** \brief  Access Enable Register 11 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_ACCEN11_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_ACCEN11;

/** \brief  Access Enable Register 20 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_ACCEN20_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_ACCEN20;

/** \brief  Access Enable Register 21 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_ACCEN21_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_ACCEN21;

/** \brief  Access Enable Register 30 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_ACCEN30_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_ACCEN30;

/** \brief  Access Enable Register 31 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_ACCEN31_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_ACCEN31;

/** \brief  DMA Clear Error Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_CLRE_Bits B;                /**< \brief Bitfield access */
} Ifx_DMA_BLK_CLRE;

/** \brief  DMA Enable Error Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_EER_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_BLK_EER;

/** \brief  DMA Error Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ERRSR_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ERRSR;

/** \brief  DMA Move Engine Channel Address and Interrupt Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_ADICR_Bits B;            /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_ADICR;

/** \brief  DMA Move Engine Channel Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_CHCR_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_CHCR;

/** \brief  DMA Move Engine Channel Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_CHSR_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_CHSR;

/** \brief  DMA Move Engine Channel Destination Address Register x */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_DADR_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_DADR;

/** \brief  DMA Move Engine Read Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R0_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R0;

/** \brief  DMA Move Engine Read Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R1_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R1;

/** \brief  DMA Move Engine Read Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R2_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R2;

/** \brief  DMA Move Engine Read Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R3_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R3;

/** \brief  DMA Move Engine Read Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R4_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R4;

