Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_regdef.h
/** \brief  DMA Move Engine Read Register 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R5_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R5;

/** \brief  DMA Move Engine Read Register 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R6_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R6;

/** \brief  DMA Move Engine Read Register 7 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R7_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R7;

/** \brief  DMA Move Engine Channel Read Data CRC Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_RDCRC_Bits B;            /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_RDCRC;

/** \brief  DMA Move Engine Channel Source Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_SADR_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_SADR;

/** \brief  DMA Move Engine Channel Source and Destination Address CRC Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_SDCRC_Bits B;            /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_SDCRC;

/** \brief  DMA Move Engine Channel Shadow Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_SHADR_Bits B;            /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_SHADR;

/** \brief  DMA Move Engine Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_SR_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_SR;

/** \brief  DMA Channel Address and Interrupt Control Register x */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_CH_ADICR_Bits B;                /**< \brief Bitfield access */
} Ifx_DMA_CH_ADICR;

/** \brief  DMA Channel Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_CH_CHCFGR_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_CH_CHCFGR;

/** \brief  DMARAM Channel Control and Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_CH_CHCSR_Bits B;                /**< \brief Bitfield access */
} Ifx_DMA_CH_CHCSR;

/** \brief  DMA Channel Destination Address Register x */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_CH_DADR_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_CH_DADR;

/** \brief  DMA Channel Read Data CRC Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_CH_RDCRCR_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_CH_RDCRCR;

/** \brief  DMA Channel Source Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_CH_SADR_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_CH_SADR;

/** \brief  DMA Channel Source and Destination Address CRC Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_CH_SDCRCR_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_CH_SDCRCR;

/** \brief  DMA Channel Shadow Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_CH_SHADR_Bits B;                /**< \brief Bitfield access */
} Ifx_DMA_CH_SHADR;

/** \brief  DMA Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_CLC_Bits B;                     /**< \brief Bitfield access */
} Ifx_DMA_CLC;

/** \brief  DMA Error Interrupt Set Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_ERRINTR_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_ERRINTR;

/** \brief  DMA Channel Hardware Resource Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_HRR_Bits B;                     /**< \brief Bitfield access */
} Ifx_DMA_HRR;

/** \brief  DMA Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_ID_Bits B;                      /**< \brief Bitfield access */
} Ifx_DMA_ID;

/** \brief  DMA Memory Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_MEMCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_DMA_MEMCON;

/** \brief  DMA Mode Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_MODE_Bits B;                    /**< \brief Bitfield access */
} Ifx_DMA_MODE;

/** \brief  DMA OCDS Trigger Set Select */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_OTSS_Bits B;                    /**< \brief Bitfield access */
} Ifx_DMA_OTSS;

