Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDma_regdef.h
/** \brief  Pattern Read Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_PRR0_Bits B;                    /**< \brief Bitfield access */
} Ifx_DMA_PRR0;

/** \brief  Pattern Read Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_PRR1_Bits B;                    /**< \brief Bitfield access */
} Ifx_DMA_PRR1;

/** \brief  DMA Suspend Acknowledge Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_SUSACR_Bits B;                  /**< \brief Bitfield access */
} Ifx_DMA_SUSACR;

/** \brief  DMA Suspend Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_SUSENR_Bits B;                  /**< \brief Bitfield access */
} Ifx_DMA_SUSENR;

/** \brief  Time Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_TIME_Bits B;                    /**< \brief Bitfield access */
} Ifx_DMA_TIME;

/** \brief  DMA Transaction State Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_TSR_Bits B;                     /**< \brief Bitfield access */
} Ifx_DMA_TSR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dma_struct
 * \{  */
/******************************************************************************/
/** \name Object L2
 * \{  */

/** \brief  DMA move engine */
typedef volatile struct _Ifx_DMA_BLK_ME
{
    Ifx_DMA_BLK_ME_SR SR;                   /**< \brief 0, DMA Move Engine Status Register */
    unsigned char reserved_4[12];           /**< \brief 4, \internal Reserved */
    Ifx_DMA_BLK_ME_R0 R0;                   /**< \brief 10, DMA Move Engine Read Register 0 */
    Ifx_DMA_BLK_ME_R1 R1;                   /**< \brief 14, DMA Move Engine Read Register 1 */
    Ifx_DMA_BLK_ME_R2 R2;                   /**< \brief 18, DMA Move Engine Read Register 2 */
    Ifx_DMA_BLK_ME_R3 R3;                   /**< \brief 1C, DMA Move Engine Read Register 3 */
    Ifx_DMA_BLK_ME_R4 R4;                   /**< \brief 20, DMA Move Engine Read Register 4 */
    Ifx_DMA_BLK_ME_R5 R5;                   /**< \brief 24, DMA Move Engine Read Register 5 */
    Ifx_DMA_BLK_ME_R6 R6;                   /**< \brief 28, DMA Move Engine Read Register 6 */
    Ifx_DMA_BLK_ME_R7 R7;                   /**< \brief 2C, DMA Move Engine Read Register 7 */
    unsigned char reserved_30[32];          /**< \brief 30, \internal Reserved */
    Ifx_DMA_BLK_ME_RDCRC RDCRC;             /**< \brief 50, DMA Move Engine Channel Read Data CRC Register */
    Ifx_DMA_BLK_ME_SDCRC SDCRC;             /**< \brief 54, DMA Move Engine Channel Source and Destination Address CRC Register */
    Ifx_DMA_BLK_ME_SADR SADR;               /**< \brief 58, DMA Move Engine Channel Source Address Register */
    Ifx_DMA_BLK_ME_DADR DADR;               /**< \brief 5C, DMA Move Engine Channel Destination Address Register x */
    Ifx_DMA_BLK_ME_ADICR ADICR;             /**< \brief 60, DMA Move Engine Channel Address and Interrupt Control Register */
    Ifx_DMA_BLK_ME_CHCR CHCR;               /**< \brief 64, DMA Move Engine Channel Control Register */
    Ifx_DMA_BLK_ME_SHADR SHADR;             /**< \brief 68, DMA Move Engine Channel Shadow Address Register */
    Ifx_DMA_BLK_ME_CHSR CHSR;               /**< \brief 6C, DMA Move Engine Channel Status Register */
} Ifx_DMA_BLK_ME;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dma_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  DMA sub block */
typedef volatile struct _Ifx_DMA_BLK
{
    Ifx_DMA_BLK_EER EER;                    /**< \brief 0, DMA Enable Error Register */
    Ifx_DMA_BLK_ERRSR ERRSR;                /**< \brief 4, DMA Error Status Register */
    Ifx_DMA_BLK_CLRE CLRE;                  /**< \brief 8, DMA Clear Error Register */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_DMA_BLK_ME ME;                      /**< \brief 10, DMA move engine */
} Ifx_DMA_BLK;

/** \brief  DMA channels */
typedef volatile struct _Ifx_DMA_CH
{
    Ifx_DMA_CH_RDCRCR RDCRCR;               /**< \brief 0, DMA Channel Read Data CRC Register */
    Ifx_DMA_CH_SDCRCR SDCRCR;               /**< \brief 4, DMA Channel Source and Destination Address CRC Register */
    Ifx_DMA_CH_SADR SADR;                   /**< \brief 8, DMA Channel Source Address Register */
    Ifx_DMA_CH_DADR DADR;                   /**< \brief C, DMA Channel Destination Address Register x */
    Ifx_DMA_CH_ADICR ADICR;                 /**< \brief 10, DMA Channel Address and Interrupt Control Register x */
    Ifx_DMA_CH_CHCFGR CHCFGR;               /**< \brief 14, DMA Channel Configuration Register */
    Ifx_DMA_CH_SHADR SHADR;                 /**< \brief 18, DMA Channel Shadow Address Register */
    Ifx_DMA_CH_CHCSR CHCSR;                 /**< \brief 1C, DMARAM Channel Control and Status Register */
} Ifx_DMA_CH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dma_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  DMA object */
typedef volatile struct _Ifx_DMA
{
    Ifx_DMA_CLC CLC;                        /**< \brief 0, DMA Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_DMA_ID ID;                          /**< \brief 8, DMA Module Identification Register */
    unsigned char reserved_C[20];           /**< \brief C, \internal Reserved */
    Ifx_DMA_MEMCON MEMCON;                  /**< \brief 20, DMA Memory Control Register */
    unsigned char reserved_24[28];          /**< \brief 24, \internal Reserved */
    Ifx_DMA_ACCEN00 ACCEN00;                /**< \brief 40, Access Enable Register 00 */
    Ifx_DMA_ACCEN01 ACCEN01;                /**< \brief 44, Access Enable Register 01 */
    Ifx_DMA_ACCEN10 ACCEN10;                /**< \brief 48, Access Enable Register 10 */
    Ifx_DMA_ACCEN11 ACCEN11;                /**< \brief 4C, Access Enable Register 11 */
    Ifx_DMA_ACCEN20 ACCEN20;                /**< \brief 50, Access Enable Register 20 */
    Ifx_DMA_ACCEN21 ACCEN21;                /**< \brief 54, Access Enable Register 21 */
    Ifx_DMA_ACCEN30 ACCEN30;                /**< \brief 58, Access Enable Register 30 */
    Ifx_DMA_ACCEN31 ACCEN31;                /**< \brief 5C, Access Enable Register 31 */
    unsigned char reserved_60[192];         /**< \brief 60, \internal Reserved */
    Ifx_DMA_BLK BLK0;                       /**< \brief 120, DMA sub block 0 */
    unsigned char reserved_1A0[3968];       /**< \brief 1A0, \internal Reserved */
    Ifx_DMA_BLK BLK1;                       /**< \brief 1120, DMA sub block 1 */
    unsigned char reserved_11A0[96];        /**< \brief 11A0, \internal Reserved */
    Ifx_DMA_OTSS OTSS;                      /**< \brief 1200, DMA OCDS Trigger Set Select */
    Ifx_DMA_ERRINTR ERRINTR;                /**< \brief 1204, DMA Error Interrupt Set Register */
    Ifx_DMA_PRR0 PRR0;                      /**< \brief 1208, Pattern Read Register 0 */
    Ifx_DMA_PRR1 PRR1;                      /**< \brief 120C, Pattern Read Register 1 */
    Ifx_DMA_TIME TIME;                      /**< \brief 1210, Time Register */
    unsigned char reserved_1214[236];       /**< \brief 1214, \internal Reserved */
    Ifx_DMA_MODE MODE[4];                   /**< \brief 1300, DMA Mode Register */
    unsigned char reserved_1310[1264];      /**< \brief 1310, \internal Reserved */
    Ifx_DMA_HRR HRR[128];                   /**< \brief 1800, DMA Channel Hardware Resource Register */
    Ifx_DMA_SUSENR SUSENR[128];             /**< \brief 1A00, DMA Suspend Enable Register */
    Ifx_DMA_SUSACR SUSACR[128];             /**< \brief 1C00, DMA Suspend Acknowledge Register */
    Ifx_DMA_TSR TSR[128];                   /**< \brief 1E00, DMA Transaction State Register */
    Ifx_DMA_CH CH[128];                     /**< \brief 2000, DMA channels */
    unsigned char reserved_3000[4096];      /**< \brief 3000, \internal Reserved */
} Ifx_DMA;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDMA_REGDEF_H */
